Revit 2027 API
RepeaterCoordinates(Int32) Constructor
 Creates one dimensional coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RepeaterCoordinates(
	int x
)
Public Sub New (
	x As Integer
)
public:
RepeaterCoordinates(
	int x
)
new :
        x : int -> RepeaterCoordinates
Parameters
x Int32
 The coordinate.
See Also
Reference
RepeaterCoordinates Class
RepeaterCoordinates Overload
Autodesk.Revit.DB Namespace